'''Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
'''

a = int(input('Введите номер буквы в алфавите'))

c = chr(a + 64)

print(c)