'''Найти сумму и произведение цифр трехзначного числа, которое вводит пользователь.'''


abc = int(input('Введите трехзначное число: '))
print(abc)